app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "adsf"], ["password", "asdf"], ["created_at", "2020-08-08 17:24:52.350106"], ["updated_at", "2020-08-08 17:24:52.350106"]]